Конфигурация/InformationRegisters/КвалифицированныеИнвесторы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КвалифицированныеИнвесторы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Является</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВСилуЗакона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/КвалифицированныеИнвесторы/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	Если ЗначениеЗаполнено(Запись.Организация) Тогда
		ЭтаФорма.ТипКвалИнвестора = 2;
	Иначе
		ЭтаФорма.ТипКвалИнвестора = 1;
	КонецЕсли;
	
	Элементы.Организация.Видимость = (ЭтаФорма.ТипКвалИнвестора = 2);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		Запись.ВСилуЗакона = Истина;
	КонецЕсли; 
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТипКвалИнвестораПриИзменении(Элемент)
	
	Если      ЭтаФорма.ТипКвалИнвестора = 1 Тогда
		Запись.ВСилуЗакона = Истина;
		Запись.Организация = Неопределено;
	ИначеЕсли ЭтаФорма.ТипКвалИнвестора = 2 Тогда
		Запись.ВСилуЗакона = Ложь;
		Запись.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	КонецЕсли;
	
	Элементы.Организация.Видимость = (ЭтаФорма.ТипКвалИнвестора = 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Запись.Является И НЕ Запись.ВСилуЗакона Тогда
		Если НЕ ЗначениеЗаполнено(Запись.Организация) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрана организация!",,,"Организация", Отказ);
		КонецЕсли;
	ИначеЕсли Запись.ВСилуЗакона И ЗначениеЗаполнено(Запись.Организация) Тогда 
		Запись.Организация = Неопределено;
	КонецЕсли;
	
КонецПроцедуры
